#include <stdio.h>   // Для функції printf
#include <stdlib.h>  // Для функції system

int main() {
    // Перший блок
    int a1 = 3, a2 = 8;
    a2 -= a1;  // a2 = 8 - 3 = 5
    int b1 = a1 + 2 * a2 * a2;  // b1 = 3 + 2 * 5 * 5 = 13
    int b2 = !a1;  // b2 = 0, бо a1 != 0
    int b3 = b2++;  // b3 = 0, b2 збільшується до 1
    float f1 = 1.5, f2 = 1.5;
    float r1 = f1 * f1 + 2 * f2;  // r1 = 1.5 * 2 + 2 * 1.5 = 6
    float r2 = (f1 != f2) ? f1 - 0.3f : f2 + 0.4f;  // r2 = 1.5 + 0.4 = 1.9
    printf("Перший блок: a2 = %d, b1 = %d, b2 = %d, b3 = %d, r1 = %.2f, r2 = %.2f\n", a2, b1, b2, b3, r1, r2);

    // Другий блок
    a1 = 2; a2 = 3;
    a2 *= 10;  // a2 = 3 * 10 = 30
    b1 = a1 * 3 + a2;  // b1 = 2 * 3 + 30 = 36
    b2 = a1 > a2;  // b2 = 0, бо 2 < 30
    b3 = ++b2;  // b2 збільшується до 1, b3 = 1
    f1 = 1.5; f2 = 1.5;
    r1 = 2 * f1 - f2;  // r1 = 2 * 1.5 - 1.5 = 1.5
    r2 = (f1 == f2) ? f1 * 3 : f2 * 5;  // r2 = 1.5 * 3 = 4.5
    printf("Другий блок: a2 = %d, b1 = %d, b2 = %d, b3 = %d, r1 = %.2f, r2 = %.2f\n", a2, b1, b2, b3, r1, r2);

    // Третій блок
    a1 = 6; a2 = 20;
    a2 /= 5;  // a2 = 20 / 5 = 4
    b1 = 5 * a1 + a2 * a2;  // b1 = 5 * 6 + 4 * 2 = 38
    b2 = a1 > a2;  // b2 = 1, бо 6 > 4
    b3 = --b2;  // b2 зменшується до 0, b3 = 0
    f1 = 1.5; f2 = 3.5;
    r1 = f1 + 4 * f2;  // r1 = 1.5 + 4 * 3.5 = 15.5
    r2 = (f1 >= f2) ? f1 - 2.5 : f2 + 5.2;  // r2 = 3.5 + 5.2 = 8.7
    printf("Третій блок: a2 = %d, b1 = %d, b2 = %d, b3 = %d, r1 = %.2f, r2 = %.2f\n", a2, b1, b2, b3, r1, r2);

    // Четвертий блок
    a1 = 3; a2 = 2;
    a2 += a1 + 5;  // a2 = 2 + 3 + 5 = 10
    b1 = a1 * a1 * a1 + 3 * a2;  // b1 = 3 * 3 * 3 + 3 * 10 = 39
    b2 = a1 < a2;  // b2 = 1, бо 3 < 10
    b3 = b2--;  // b3 = 1, після цього b2 = 0
    f1 = 1.5; f2 = 2.5;
    r1 = f1 / f2 * 2;  // r1 = (1.5 / 2.5) * 2 = 1.2
    r2 = (f1 <= f2) ? f1 - 0.2 : f2 + 0.7;  // r2 = 1.5 - 0.2 = 1.3
    printf("Четвертий блок: a2 = %d, b1 = %d, b2 = %d, b3 = %d, r1 = %.2f, r2 = %.2f\n", a2, b1, b2, b3, r1, r2);

    // П'ятий блок
    a1 = 5; a2 = 13;
    a2 -= a1 + 5;  // a2 = 13 - (5 + 5) = 3
    b1 = a1 + a2 * a2;  // b1 = 5 + 3 * 3    = 11
    b2 = a1 > a2;  // b2 = 1, бо 5 > 3
    b3 = b2++;  // b3 = 1, після цього b2 = 2
    f1 = 4.5; f2 = 1.8;
    r1 = f1 + f2 / 2;  // r1 = 4.5 + 1.8 / 2 = 5.4
    r2 = (f1 > f2) ? f1 + 1.2 : f2 - 1.4;  // r2 = 4.5 + 1.2 = 5.7
    printf("П'ятий блок: a2 = %d, b1 = %d, b2 = %d, b3 = %d, r1 = %.2f, r2 = %.2f\n", a2, b1, b2, b3, r1, r2);
    
    return 0;
}
